/* IDCW_DEV_CMD */

/* Device commands */

/* Request status */
dcl SOCKETDEV_request_status init (0) fixed bin (35);

/* Reset and initialize device */
dcl SOCKETDEV_socket init (1) fixed bin (35);

/* T&D */
dcl SOCKETDEV_test init(3) fixed bin (35);
 
/* Data block for socket() call */
dcl 1 SOCKETDEV_socket_data aligned,
      2 domain fixed bin,
      2 type fixed bin,
      2 protocol fixed bin;
      2 pid fixed bin;
      2 fd fixed bin;
      2 errno fixed bin;

/* Expecting tally to be 6 */
/* domain, type and protocol are from the API parameters */
/* pid is the Process ID of the calling process */
/* fd, errno are the values returned by the host socket() call */


/* Data block for bind() call */
dcl 1 SOCKETDEV_bind_data aligned,
      2 sockaddr like sockaddr_in,
      2 pid fixed bin;
      2 code fixed bin;
      2 errno fixed bin;

/* Expecting tally to be 6 */
/* sockaddr is from the API parameter */
/* pid is the Process ID of the calling process */
/* odoe, errno are the values returned by the host socket() call */


